In [1]:
import pandas as pd

In [3]:
df_master = pd.read_csv("../data/Customer-Churn-Records.csv")
df = df_master.copy()

In [4]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,Satisfaction Score,Card Type,Point Earned
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1,1,2,DIAMOND,464
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,1,3,DIAMOND,456
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,1,3,DIAMOND,377
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0,5,GOLD,350
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0,5,GOLD,425

In [5]:
df_sample = df.sample(100)
df_sample.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,Satisfaction Score,Card Type,Point Earned
7779,7780,15699225,Pirozzi,757,France,Male,46,0,0.00,2,1,0,37460.05,0,0,5,DIAMOND,748
5259,5260,15614635,Kepley,582,France,Male,52,2,151457.88,1,0,1,40893.61,0,0,5,DIAMOND,889
2238,2239,15808784,Hess,835,France,Male,28,2,163569.61,2,1,1,154559.28,0,0,5,PLATINUM,560
4352,4353,15765192,Jones,564,France,Male,26,7,84006.88,2,0,0,183490.99,0,0,5,SILVER,984
8766,8767,15638159,Trentino,649,Spain,Female,36,6,86607.39,1,0,0,19825.09,0,0,3,PLATINUM,998

In [10]:
for i in range(10):
    df_sample_1 = df.sample(100)
    df_sample_1.to_csv(f'../data/Folder A/customers_file_{i+1}.csv', index=False)

In [11]:
test_file = pd.read_csv("../data/Folder A/customers_file_1.csv")
test_file.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,Satisfaction Score,Card Type,Point Earned
0,6056,15623972,Wisdom,479,Germany,Female,23,9,123575.51,1,0,1,95148.28,0,0,3,GOLD,787
1,6672,15795933,Barese,677,France,Female,49,3,0.00,2,1,1,187811.71,0,0,3,GOLD,643
2,5139,15589969,Capon,850,France,Male,34,6,0.00,1,0,1,52796.31,0,0,3,GOLD,831
3,4160,15732268,Cook,751,France,Male,29,3,159597.45,1,1,0,39934.41,0,0,5,PLATINUM,791
4,4662,15670416,Ferri,780,France,Female,43,0,0.00,1,0,1,15705.27,0,0,1,DIAMOND,245
5,2423,15607837,Muriel,746,France,Female,29,4,105599.67,1,1,1,43106.17,0,0,3,DIAMOND,425
6,229,15637753,O'Sullivan,751,Germany,Male,50,2,96888.39,1,1,0,77206.25,1,1,2,DIAMOND,756
7,8806,15758546,Norton,850,Spain,Male,39,8,0.00,2,1,1,37090.44,0,0,3,DIAMOND,995
8,4786,15702138,Swift,510,France,Female,22,3,156834.34,1,0,0,44374.44,0,0,2,DIAMOND,821
9,7456,15748499,Johnson,550,Germany,Male,33,4,118400.91,1,0,1,13999.64,1,1,3,PLATINUM,362